package main

import "fmt"

// Обмен значениями без третьей переменной

// Поменять местами два числа без использования временной переменной.

// Подсказка: примените сложение/вычитание или XOR-обмен.

func main() {
	var a int = 256

	var b int = 128
	// xor обмен
	fmt.Println("do XOR: ", a, b)

	// a - 100000000
	// b - 010000000
	// a ^ b = 110000000 = 2^7 + 2^8 = 256 + 128 = 384
	a = a ^ b // 384
	// 110000000
	// 010000000
	b = b ^ a // b ^ a = 100000000 = 256
	a = a ^ b // 110000000 xor -> 010000000 = 128
	// 100000000

	fmt.Println("posle XOR: ", a, b)

	// сложение и вычитание
	fmt.Println("do vicheta: ", a, b)

	a = a + b // a = 384 b = 256
	b = (a - b)
	a = a - b

	fmt.Println("posle vicheta: ", a, b)

}
